{
    "funny": [
        "Are you a magician? Because whenever I look at your profile, everyone else disappears.",
        "Do you have a name, or can I call you mine?",
        "Is your dad a boxer? Because you're a knockout!",
        "Do you believe in love at first swipe, or should I unmatch and swipe right again?",
        "I'm not a photographer, but I can definitely picture us together.",
        "Are you my appendix? Because I don't know what you do, but this feeling in my stomach makes me want to take you out.",
        "If you were a vegetable, you'd be a cute-cumber.",
        "Is there an airport nearby or is that just my heart taking off?",
        "On a scale of 1 to 10, you're a 9 and I'm the 1 you need.",
        "Do you have a map? I keep getting lost in your eyes.",
        "If you were a triangle, you'd be acute one.",
        "Are you Wi-Fi? Because I'm feeling a connection.",
        "Is your name Google? Because you have everything I've been searching for.",
        "I must be a snowflake because I've fallen for you.",
        "Do you like Star Wars? Because Yoda the one for me.",
        "Are you a parking ticket? Because you've got 'fine' written all over you.",
        "Do you have a sunburn or are you always this hot?",
        "I'm not a genie, but I can make your dreams come true.",
        "Are you a bank loan? Because you have my interest.",
        "Is your dad a baker? Because you're a cutie pie.",
        "Do you believe in love at first sight or should I walk by again?",
        "If you were a fruit, you'd be a fineapple.",
        "Are you a camera? Because every time I look at you, I smile.",
        "Do you have a band-aid? I scraped my knee falling for you.",
        "I must be a snowstorm because you're making my heart race.",
        "Are you a time traveler? Because I see you in my future.",
        "Do you have a name or can I call you mine?",
        "Is your dad a thief? Because he stole the stars and put them in your eyes.",
        "Are you a campfire? Because you're hot and I want s'more.",
        "Do you have a map? Because I just got lost in your eyes."
    ],
    "emotional": [
        "What's something that makes you feel truly alive?",
        "What's a moment that changed your life forever?",
        "What's something you're deeply grateful for?",
        "What's a memory that always brings tears to your eyes?",
        "What's something you wish people understood about you?",
        "What's a fear you've never told anyone about?",
        "What's something that makes your heart skip a beat?",
        "What's a place that feels like home to you?",
        "What's something that makes you feel vulnerable?",
        "What's a dream you hold close to your heart?",
        "What's something that never fails to make you emotional?",
        "What's a relationship that has shaped who you are?",
        "What's something you've never been able to forget?",
        "What's a moment when you felt completely understood?",
        "What's something that gives you chills every time?",
        "What's a secret you've never shared with anyone?",
        "What's something that makes you feel truly connected?",
        "What's a time when you felt completely lost?",
        "What's something that brings you peace?",
        "What's a moment when you felt pure joy?",
        "What's something you've never been able to let go of?",
        "What's a place that holds special meaning for you?",
        "What's something that makes you feel truly alive?",
        "What's a time when you felt completely broken?",
        "What's something that gives you hope?",
        "What's a moment when you felt truly loved?",
        "What's something that makes you feel truly seen?",
        "What's a time when you felt completely alone?",
        "What's something that makes you feel truly inspired?",
        "What's a moment when you felt truly free?"
    ],
    "question": [
        "What's the most spontaneous thing you've ever done?",
        "If you could travel anywhere in the world right now, where would you go?",
        "What's your go-to comfort food?",
        "What's the best concert you've ever been to?",
        "What's a skill you've always wanted to learn?",
        "What's your favorite way to spend a weekend?",
        "What's the most interesting place you've ever visited?",
        "What's a book or movie that has had a big impact on you?",
        "What's your favorite childhood memory?",
        "What's something on your bucket list that you haven't done yet?",
        "What's your favorite season and why?",
        "What's the best meal you've ever had?",
        "What's a hobby you'd like to pick up?",
        "What's your favorite way to relax?",
        "What's something you're looking forward to?",
        "What's your favorite type of music and why?",
        "What's the best gift you've ever received?",
        "What's something that always makes you smile?",
        "What's your favorite thing about where you live?",
        "What's a skill you're proud of?",
        "What's your favorite way to exercise?",
        "What's the most beautiful place you've ever seen?",
        "What's something you're passionate about?",
        "What's your favorite holiday and why?",
        "What's the best advice you've ever given someone?",
        "What's something you're curious about?",
        "What's your favorite way to spend time with friends?",
        "What's something you've never done but want to try?",
        "What's your favorite thing about yourself?",
        "What's a place you'd love to visit again?"
    ],
    "compliment": [
        "You have a really great smile, it must brighten up every room you walk into.",
        "Your profile shows you have such a positive energy, it's really refreshing.",
        "You seem like someone who knows how to have a good time, I love that.",
        "Your sense of style is really impressive, you have great taste.",
        "You have such a warm and friendly vibe, it's really attractive.",
        "Your profile photos show you have such a zest for life, it's inspiring.",
        "You seem really genuine and down-to-earth, that's rare to find.",
        "Your bio made me smile, you have a great way with words.",
        "You have an amazing sense of humor, it's really attractive.",
        "Your profile shows you're really passionate about your interests, that's cool.",
        "You seem like a great conversationalist, I'd love to chat more.",
        "Your photos show you have such a positive outlook on life.",
        "You seem really adventurous, I love that about people.",
        "You have a really great energy, it's contagious.",
        "Your profile shows you're really thoughtful, I appreciate that.",
        "You have such a kind and caring presence, it's really nice.",
        "Your confidence is really attractive, I admire that.",
        "You seem really intelligent and interesting, I'd love to learn more about you.",
        "Your profile shows you have a great sense of adventure.",
        "You have such a warm and welcoming smile.",
        "Your photos show you're really fun and outgoing.",
        "You seem really creative and artistic, that's really cool.",
        "Your profile shows you have a great sense of humor.",
        "You have such a positive and uplifting energy.",
        "Your bio shows you're really thoughtful and introspective.",
        "You seem really passionate about what you do, that's attractive.",
        "Your photos show you're really adventurous and spontaneous.",
        "You have such a genuine and authentic presence.",
        "Your profile shows you're really well-traveled and cultured.",
        "You seem really confident and self-assured, that's really attractive."
    ],
    "adventure": [
        "What's the most adventurous thing on your bucket list?",
        "Have you ever gone on a spontaneous trip? Tell me about it!",
        "Would you rather go skydiving or scuba diving?",
        "What's the most beautiful place you've ever hiked?",
        "If we were to go on an adventure together, where would we go?",
        "What's your favorite outdoor activity?",
        "Have you ever tried any extreme sports?",
        "What's the most memorable adventure you've had so far?",
        "What's the most challenging hike you've ever done?",
        "Have you ever been on a road trip with no destination in mind?",
        "What's the most exotic place you've ever visited?",
        "Would you rather explore the jungle or the ocean?",
        "What's your favorite way to explore a new city?",
        "Have you ever camped under the stars?",
        "What's the most adventurous thing you've eaten?",
        "What's the most remote place you've ever been to?",
        "Have you ever gone zip-lining or bungee jumping?",
        "What's the most beautiful sunset you've ever seen?",
        "Have you ever gone on a solo adventure?",
        "What's the most exciting thing you've done while traveling?",
        "Have you ever gone snorkeling or scuba diving?",
        "What's the most breathtaking view you've ever witnessed?",
        "Have you ever gone on a wildlife safari?",
        "What's the most adventurous meal you've ever tried?",
        "Have you ever gone rock climbing or mountaineering?",
        "What's the most thrilling experience you've ever had?",
        "Have you ever gone paragliding or hang gliding?",
        "What's the most beautiful natural wonder you've ever seen?",
        "Have you ever gone on a spontaneous adventure?",
        "What's the most exciting place you've ever visited?",
        "Have you ever gone kayaking or white-water rafting?",
        "What's the most memorable travel experience you've had?"
    ],
    "flirting": [
        "I think someone stole the stars from the sky and put them in your eyes.",
        "Do you have a name or can I call you mine?",
        "I'm not a photographer, but I can definitely picture us together.",
        "Do you believe in love at first swipe or should I swipe right again?",
        "If you were a vegetable, you'd be a cute-cumber.",
        "Are you a magician? Because whenever I look at your profile, everyone else disappears.",
        "I must be a snowflake because I've fallen for you.",
        "Do you have a map? I keep getting lost in your eyes.",
        "Is your dad a baker? Because you're a cutie pie.",
        "Do you have a sunburn or are you always this hot?",
        "I'm not a genie, but I can make your dreams come true.",
        "Are you a parking ticket? Because you've got 'fine' written all over you.",
        "Do you have a band-aid? I scraped my knee falling for you.",
        "If you were a fruit, you'd be a fineapple.",
        "Are you Wi-Fi? Because I'm feeling a connection.",
        "Is your name Google? Because you have everything I've been searching for.",
        "Do you like Star Wars? Because Yoda the one for me.",
        "Are you a time traveler? Because I see you in my future.",
        "I must be a snowstorm because you're making my heart race.",
        "Are you a campfire? Because you're hot and I want s'more.",
        "Do you have a name or can I call you mine?",
        "Is your dad a thief? Because he stole the stars and put them in your eyes.",
        "Are you a bank loan? Because you have my interest.",
        "Do you believe in love at first sight or should I walk by again?",
        "If you were a triangle, you'd be acute one.",
        "Are you a camera? Because every time I look at you, I smile.",
        "I'm not a weatherman, but you can expect a few inches tonight.",
        "Do you have a name or can I call you mine?",
        "Are you a dictionary? Because you add meaning to my life.",
        "Do you have a sunburn or are you always this hot?",
        "I must be a snowflake because I've fallen for you."
    ]
}
